
&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры   

&НаКлиенте
Процедура СписокНоменклатурыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование Тогда
		Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");	
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура СписокНоменклатурыПослеУдаления(Элемент)
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры