Функция КурсВалютыДоговора(Договор, ДатаДокумента) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Валюта КАК Валюта
		|ПОМЕСТИТЬ втВалюты
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) КАК Курс,
		|	втВалюты.Валюта КАК Валюта
		|ИЗ
		|	втВалюты КАК втВалюты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&Период,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						втВалюты.Валюта КАК Валюта
		|					ИЗ
		|						втВалюты КАК втВалюты)) КАК КурсыВалютСрезПоследних
		|		ПО втВалюты.Валюта = КурсыВалютСрезПоследних.Валюта";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	Запрос.УстановитьПараметр("Период", ДатаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.Валюта = Справочники.Валюты.РоссийскийРубль Тогда
			Возврат 1;
		Иначе
			Возврат Выборка.Курс;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Неопределено;
		
КонецФункции
